/**
 * 正则表达式
 */

const reg = {
  // 数字类型
  num: /^[+-]?\d(\.\d+)?$/,
  // 负数
  negative: /^-\d/,
  // 正整数
  integerAndZero: /^\d+(\.\d+)?$/,
  // 只能输入正整数, 不超过13位
  integerNoZero: /^[1-9]?\d{1,12}$/,
  // 只能输入整数或零，不超过13位
  anyIntegerAndZero: /^-?[1-9]?\d{1,12}$/,
  // 只能输入正整数或负整数，不超过13位
  anyIntegerNoZero: /^([1-9]\d{1,12}|-[1-9]\d{1,12})$/,
  // 整数位最长四位，小数位最长六位，不允许为负数
  moreThanZero: /^([1-9]\d{0,3}|[0])(\.\d{0,6})?$/,
  // 输入金额大于等于零，整数不超过十三位，小数不超过两位
  currency: /^(([1-9]\d{1,12}|[1-9](,\d{3}){4}|[1-9]\d{0,2}(,\d{3}){0,3})|(0))(\.(\d){0,2})?$/,
  // 识别html标签
  htmlTag: /<\s*(\S+)(\s[^>]*)?>[\s\S]*<\s*\/\1\s*>/,
  // 身份证号
  idCard: /^[1-9]\d{5}(18|19|20)\d{2}((0[1-9])|(1[0-2]))(([0-2][1-9])|10|20|30|31)\d{3}[0-9Xx]$/,
  // url地址
  url: /^http[s]?:\/\/.*/,
  // 电话号码
  phone: /^([0-9]{3,4}-)?[0-9]{7,8}$/,
  // 手机号码(国内)
  phoneNumber: /^1[0-9]{10}$/,
  // 六位验证码
  code: /^\d{6}$/,
  // email
  email: /^([a-zA-Z0-9_-])+@([a-zA-Z0-9_-])+((.[a-zA-Z0-9_-]{2,3}){1,2})$/,
};

export default reg;
